package Lektii.Lektii01;

public class OblastiVidimostiPeremenux {
    public static void main(String[] args) {
//****************************************************************************
//                  ОБЛАСТЬ ВИДИМОСТИ ПЕРЕМЕННЫХ
/* У переменных существует понятие «область видимости».
Если переменную объявили внутри некоторого блока фигурных скобок { },
то снаружи этого блока переменная будет недоступна.*/
//****************************************************************************
        {
            int i = 123;
            System.out.println(i);

        }

    //    System.out.println(i);      // error: cannot find symbol





    }
}
